# SpacingRuleLayout Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..SpacingRuleLayout Property
DividedPath Class See Also
---
The layout determines how points are distributed along the path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SpacingRuleLayout SpacingRuleLayout { get; set; }
```

Visual Basic
---
```text
Public Property SpacingRuleLayout As SpacingRuleLayout
	Get
	Set
```

Visual C++
---
```text
public:
property SpacingRuleLayout SpacingRuleLayout {
	SpacingRuleLayout get ();
	void set (SpacingRuleLayout value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: Invalid layout -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace